question_data = [
    {"text": "バス酔いを防ぐためには「オレンジジュース」が効果的である。", "answer": "X",
     "explanation": "オレンジジュースなど柑橘系の飲み物は、酔いを悪化させる可能性が高まるため炭酸であっても避けましょう。"},

    {"text": "東京都にある島の中で最も面積の広い島は伊豆大島である？", "answer": "O", "explanation": "面積が約90km^2で都内で最も広い島になっています。"},

    {"text": "日本の国花は桜と菊の2つである。", "answer": "O", "explanation": "日本では国花は二つあり、桜と菊となっています。"},

    {"text": "賞味期限が、記載されていないアイスクリームがある？", "answer": "O",
     "explanation": "マイナス18°C以下で保存されているアイスクリームは、品質の劣化リスクが極めて低く、食品衛生法の乳等省令でも賞味期限の記載を義務化していないです。"},

    {"text": "寒い時にはアルコールを摂取すると体があたたまる。", "answer": "X",
     "explanation": "アルコールの作用で血管が広がり血行が促進されるので一時的には温まったように感じるかもしれませんが結局その作用によって実質的により体温が下がります。"},

    {"text": "エッフェル塔は夏になると高さが増す。", "answer": "O", "explanation": "エッフェル塔は夏、暑さで鉄が伸びて約15cm高くなります。"},

]
